artillery/stressTest.yml
config:
  target: "http://localhost:1337/api"
  phases:
    - duration: 1
      arrivalRate: 100
  # defaults:
  #   headers:
  #     x-my-service-auth: '987401838271002188298567'
  processor: './fakeDataGeneration.js'
scenarios:
  - name: 'Add User'
    flow:
      - function: 'generateUser'
      - post:
          url: '/signup'
          json:
            profile_name: '{{ profile_name }}'
            password: '{{ password }}'
            email: '{{ email }}'
            region: '{{ region }}'
            preferences: '{{ preferences }}'
      - post:
          url: '/login'
          json:
            profile_name: '{{ profile_name }}'
            password: '{{ password }}'

  - name: 'Video Save'
    flow:
      - function: 'generateVideoSaved'
      - post:
          url: '/saved'
          json:
            user_id: '{{ user_id }}'
            video_id: '{{ video_id }}'
            saved_time: '{{ saved_time }}'

  - name: 'Video Watched'
    flow:
      - function: 'generateVideoWatched'
      - post:
          url: '/watched'
          json:
            user_id: '{{ user_id }}'
            video_id: '{{ video_id }}'
            rating: '{{ rating }}'

  - name: 'Login'
    flow:
      - function: 'generateFakeLog'
      - post:
          url: '/login/redis'
          json:
            user_id: '{{ user_id }}'
            region: '{{ region }}'

  - name: 'Logout'
    flow:
      - function: 'generateFakeLog'
      - post:
          url: '/logout/redis'
          json:
            user_id: '{{ user_id }}'
            region: '{{ region }}'